test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
 <hashTree>
  <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="测试计划" enabled="true">
   <stringProp name="TestPlan.comments">测试计划描述</stringProp>
   <boolProp name="TestPlan.functional_mode">false</boolProp>
   <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
   <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
   <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
    <collectionProp name="Arguments.arguments"/>
   </elementProp>
  </TestPlan>
  <hashTree>
   <DNSCacheManager guiclass="DNSCachePanel" testclass="DNSCacheManager" testname="DNS缓存管理器" enabled="true">
    <collectionProp name="DNSCacheManager.servers"/>
    <collectionProp name="DNSCacheManager.hosts">
     <elementProp name="las.secoo.com" elementType="StaticHost">
      <stringProp name="StaticHost.Name">las.secoo.com</stringProp>
      <stringProp name="StaticHost.Address">112.126.120.128</stringProp>
     </elementProp>
    </collectionProp>
    <boolProp name="DNSCacheManager.clearEachIteration">false</boolProp>
    <boolProp name="DNSCacheManager.isCustomResolver">true</boolProp>
   </DNSCacheManager>
   <hashTree/> 
   <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie管理器" enabled="true">
    <collectionProp name="CookieManager.cookies"/>
    <boolProp name="CookieManager.clearEachIteration">true</boolProp>
   </CookieManager>
   <hashTree/> 
   <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="数据文件1" enabled="true">
    <stringProp name="filename">dat/data.csv</stringProp>
    <stringProp name="fileEncoding">UTF-8</stringProp>
    <stringProp name="variableNames">a,b</stringProp>
    <boolProp name="ignoreFirstLine">true</boolProp>
    <stringProp name="delimiter">,</stringProp>
    <boolProp name="quotedData">false</boolProp>
    <boolProp name="recycle">true</boolProp>
    <boolProp name="stopThread">false</boolProp>
    <stringProp name="shareMode">shareMode.group</stringProp>
   </CSVDataSet>
   <hashTree/>
   <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="数据文件2" enabled="true">
    <stringProp name="filename">dat/data.csv</stringProp>
    <stringProp name="fileEncoding">UTF-8</stringProp>
    <stringProp name="variableNames">c,d</stringProp>
    <boolProp name="ignoreFirstLine">true</boolProp>
    <stringProp name="delimiter">,</stringProp>
    <boolProp name="quotedData">false</boolProp>
    <boolProp name="recycle">true</boolProp>
    <boolProp name="stopThread">false</boolProp>
    <stringProp name="shareMode">shareMode.group</stringProp>
   </CSVDataSet>
   <hashTree/>
   <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告" enabled="true">
    <boolProp name="ResultCollector.error_logging">false</boolProp>
   </ResultCollector>
   <hashTree/>
   <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="线程组1" enabled="true">
    <stringProp name="TestPlan.comments">线程组1描述</stringProp>
    <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
    <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
     <boolProp name="LoopController.continue_forever">false</boolProp>
     <intProp name="LoopController.loops">-1</intProp>
    </elementProp>
    <stringProp name="ThreadGroup.num_threads">50</stringProp>
    <stringProp name="ThreadGroup.ramp_time">0</stringProp>
    <boolProp name="ThreadGroup.scheduler">true</boolProp>
    <stringProp name="ThreadGroup.duration">30</stringProp>
    <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
   </ThreadGroup>
   <hashTree> 
    <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP-GET" enabled="true">
     <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
      <collectionProp name="Arguments.arguments">  
      </collectionProp>
     </elementProp>
     <boolProp name="HTTPSampler.follow_redirects"></boolProp>
     <boolProp name="HTTPSampler.auto_redirects"></boolProp>
     <boolProp name="HTTPSampler.use_keepalive"></boolProp>
     <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
    </HTTPSamplerProxy>
    <hashTree> 
     <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV 数据文件设置" enabled="true">
      <stringProp name="delimiter">,</stringProp>
      <stringProp name="fileEncoding">UTF_8</stringProp>
      <stringProp name="filename">dat/data.csv</stringProp>
      <boolProp name="ignoreFirstLine">true</boolProp>
      <boolProp name="quotedData">false</boolProp>
      <boolProp name="recycle">true</boolProp>
      <stringProp name="shareMode">shareMode.group</stringProp>
      <boolProp name="stopThread">false</boolProp>
      <stringProp name="variableNames">a,b</stringProp>
     </CSVDataSet>
     <hashTree/> 
     <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="响应断言" enabled="true">
      <collectionProp name="Asserion.test_strings">
       <stringProp name="97">a</stringProp>
       <stringProp name="97">b</stringProp>
      </collectionProp>
      <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
      <boolProp name="Assertion.assume_success">false</boolProp>
      <intProp name="Assertion.test_type">2</intProp>
     </ResponseAssertion>
     <hashTree/>
     <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
      <boolProp name="ResultCollector.error_logging">false</boolProp>
     </ResultCollector>
     <hashTree/>
    </hashTree>
    <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP-POST" enabled="true">
     <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
      <collectionProp name="Arguments.arguments">  
      </collectionProp>
     </elementProp>
     <boolProp name="HTTPSampler.follow_redirects"></boolProp>
     <boolProp name="HTTPSampler.auto_redirects"></boolProp>
     <boolProp name="HTTPSampler.use_keepalive"></boolProp>
     <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
    </HTTPSamplerProxy>
    <hashTree>  
     <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
      <boolProp name="ResultCollector.error_logging">false</boolProp>
     </ResultCollector>
     <hashTree/>
    </hashTree>
    <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP-JSON" enabled="true">
     <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
      <collectionProp name="Arguments.arguments">  
      </collectionProp>
     </elementProp>
     <boolProp name="HTTPSampler.follow_redirects"></boolProp>
     <boolProp name="HTTPSampler.auto_redirects"></boolProp>
     <boolProp name="HTTPSampler.use_keepalive"></boolProp>
     <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
    </HTTPSamplerProxy>
    <hashTree>  
     <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
      <boolProp name="ResultCollector.error_logging">false</boolProp>
     </ResultCollector>
     <hashTree/>
    </hashTree>  
   <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="线程组2" enabled="false">
    <stringProp name="TestPlan.comments">线程组2描述</stringProp>
    <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
    <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
     <boolProp name="LoopController.continue_forever">false</boolProp>
     <intProp name="LoopController.loops">-1</intProp>
    </elementProp>
    <stringProp name="ThreadGroup.num_threads">50</stringProp>
    <stringProp name="ThreadGroup.ramp_time">0</stringProp>
    <boolProp name="ThreadGroup.scheduler">true</boolProp>
    <stringProp name="ThreadGroup.duration">30</stringProp>
    <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
   </ThreadGroup>
   <hashTree>
    <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="数据文件3" enabled="true">
    <stringProp name="filename">dat/data.csv</stringProp>
    <stringProp name="fileEncoding">UTF-8</stringProp>
    <stringProp name="variableNames">a,b</stringProp>
    <boolProp name="ignoreFirstLine">true</boolProp>
    <stringProp name="delimiter">\t</stringProp>
    <boolProp name="quotedData">false</boolProp>
    <boolProp name="recycle">true</boolProp>
    <boolProp name="stopThread">false</boolProp>
    <stringProp name="shareMode">shareMode.group</stringProp>
   </CSVDataSet>
    <hashTree/>   
    <io.github.ningyu.jmeter.plugin.dubbo.sample.DubboSample guiclass="io.github.ningyu.jmeter.plugin.dubbo.gui.DubboSampleGui" testclass="io.github.ningyu.jmeter.plugin.dubbo.sample.DubboSample" testname="查询运费接口-dubbo" enabled="true">
     <stringProp name="FIELD_DUBBO_REGISTRY_PROTOCOL">zookeeper</stringProp>
     <stringProp name="FIELD_DUBBO_RPC_PROTOCOL">dubbo://</stringProp>
     <stringProp name="FIELD_DUBBO_ADDRESS">zk-mall1.secoolocal.com:5181?backup=zk-mall2.secoolocal.com:5181,zk-mall3.secoolocal.com:5181</stringProp>
     <stringProp name="FIELD_DUBBO_TIMEOUT">100</stringProp>
     <stringProp name="FIELD_DUBBO_CONNECTIONS">100</stringProp>
     <stringProp name="FIELD_DUBBO_LOADBALANCE">random</stringProp>
     <stringProp name="FIELD_DUBBO_ASYNC">sync</stringProp>
     <stringProp name="FIELD_DUBBO_CLUSTER">failfast</stringProp>
     <stringProp name="FIELD_DUBBO_INTERFACE">com.secoo.business.config.rpc.service.BusinessConfigStoreService</stringProp>
     <stringProp name="FIELD_DUBBO_METHOD">queryFreight</stringProp>
     <intProp name="FIELD_DUBBO_METHOD_ARGS_SIZE">1</intProp>
     <intProp name="FIELD_DUBBO_ATTACHMENT_ARGS_SIZE">0</intProp>
    </io.github.ningyu.jmeter.plugin.dubbo.sample.DubboSample>
    <hashTree>  
     <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="响应断言" enabled="true">
      <collectionProp name="Asserion.test_strings">
       <stringProp name="97">"code": 0</stringProp>
      </collectionProp>
      <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
      <boolProp name="Assertion.assume_success">false</boolProp>
      <intProp name="Assertion.test_type">16</intProp>
     </ResponseAssertion> 
     <hashTree/> 
   </hashTree>
  </hashTree>
 </hashTree>
</jmeterTestPlan>